//проект игры космические захватчики 
// 
// основной класс - Game
//      Отвечает за основной цикл игры
//      Должен управлять сложностью игры
//      и в целом быть оболочкой для игровой логики программы
// Игровое поле - Scene
//      Должна знать где распологаются игровые объекты
//      и что они такое
// Класс игрового объекта - Базовый класс для всего что
//       может быть расположено на игровой сцене*
//Класс координат
//        Ну мы должны как - то запоминать позицию
// 
//
//




#include <iostream>





int main()
{
    std::cout << "Hello World!\n";
}

